<!-- dealing with nan -->

In [1]:
import pandas as pd
import numpy as np

In [3]:
# create a dummy data. 
stuff = { 'A' : [1,2,3], 'B' : [4,np.nan,6], 'C' : [7,8,9], 'D' : [10, 11, 12]}
my_df = pd.DataFrame(stuff)
my_df

   A    B  C   D
0  1  4.0  7  10
1  2  NaN  8  11
2  3  6.0  9  12

In [4]:
# if we want to drop the row containing nan values
# inplace = True karna padega if we want to permanently delete it.
my_df.dropna()

   A    B  C   D
0  1  4.0  7  10
2  3  6.0  9  12

In [7]:
# drop the coulumn containing nan values

# my_df.dropna(axis = 1) both works
my_df.dropna(axis = 'columns')

   A  C   D
0  1  7  10
1  2  8  11
2  3  9  12

In [29]:
# create a dummy data. 
data = { 'A' : [1,2,3], 'B' : [4,np.nan,np.nan], 'C' : [np.nan,8,9], 'D' : [10, np.nan, 12]}
df = pd.DataFrame(data)
df

   A    B    C     D
0  1  4.0  NaN  10.0
1  2  NaN  8.0   NaN
2  3  NaN  9.0  12.0

In [30]:
# we want to delete only that column which contains two or more than two null values.
df.dropna(thresh = 2, axis = 1)

   A    C     D
0  1  NaN  10.0
1  2  8.0   NaN
2  3  9.0  12.0

In [31]:
# we want to fill the nan cell.
# we can fill it with anything.
my_df.fillna(value="bob")

   A    B  C   D
0  1  4.0  7  10
1  2  bob  8  11
2  3  6.0  9  12

In [33]:
# we can use some basic math fun to fill the nan cell.
# the above one doesn't change the cell permanently therefore we are able to use fillna for that cell.
my_df.fillna(value = my_df["B"].mean() )

   A    B  C   D
0  1  4.0  7  10
1  2  5.0  8  11
2  3  6.0  9  12

In [37]:
# use min max
my_df.fillna(value = my_df["B"].min())

   A    B  C   D
0  1  4.0  7  10
1  2  4.0  8  11
2  3  6.0  9  12

In [39]:
my_df.fillna(value = my_df["B"].sum())

   A     B  C   D
0  1   4.0  7  10
1  2  10.0  8  11
2  3   6.0  9  12

In [38]:
my_df.fillna(value = my_df["C"].max())

   A    B  C   D
0  1  4.0  7  10
1  2  9.0  8  11
2  3  6.0  9  12